function init(){
    //במקום לרשום את הפקודה ניתן לרשוםכפי שמופיע למטה   document.getElementById(the_h2);
    alert(the_h2.innerHTML);//אינהרייט יתן לי את הערך המופיע בתוך המזהה שלפניו

}
function showinput(){
    //alert(name_txt.value)//כדי שיקבל את הערך שהמשתמש יזין ולא את הערך שיש במסך לעומת האינרייט נשתמש בוואליו
    //הפעולה הזאת תציג את מה שרשמתי באינפוט כאשר אלחץ על הכפתור כהודעה מוקפצת למעלה 
    //the_h2.innerHTML=name_txt.value;//בלחיצת כפתור פעולה זו תהפוך את הכותרת של העמוד למה שהזנתי באינפוט

    var num1=num1_txt.value;
    var num2=num2_txt.value;

    //var num3=num1+num2;//במידה ונרצה ליצור שירשור של המס כי ברירת המחדל של המערכת היא סטרינג נרשום כך
    var num3=Number(num1)+Number(num2);
    // כדי שייתייחס ויחבר את הערכים בערכים מספריים ולא כמילים נעטוף כל אחד מהמשתנים במזהה נאמבר כמו בדוגמא מעלה
    the_h2.innerHTML=num3;



}

